railsads/app/controllers/campaigns_controller.rb

SELECT "campaigns".* FROM "campaigns"
---
  def index
    @campaigns = Campaign.all

INSERT INTO "campaigns" ("campaign_end_date", "campaign_name", "campaign_start_date", "client_id", "comment", "created_at", "revenue_type", "total_target_click", "total_target_convertion", "total_target_view", "updated_at", "user_cap_reset_time", "user_hourly_cap", "user_team_cap", "user_team_daily_cap") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @campaign = Campaign.new(campaign_params)

    respond_to do |format|
      if @campaign.save