railsads/app/controllers/clients_controller.rb

  def create
    @client = Client.new(client_params)

    respond_to do |format|
      if @client.save
---
INSERT INTO "clients" ("client_name", "client_type", "comment", "contact", "created_at", "email", "report", "report_deactive", "report_interval", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)