railsads/app/controllers/publishers_controller.rb

SELECT "publishers".* FROM "publishers"
---
  def index
    @publishers = Publisher.all

INSERT INTO "publishers" ("contact", "created_at", "email", "publisher_name", "publisher_type", "updated_at", "website") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @publisher = Publisher.new(publisher_params)

    respond_to do |format|
      if @publisher.save

SELECT "publishers".* FROM "publishers" WHERE "publishers"."id" = ? LIMIT 1  [["id", "2"]]
---
    def set_publisher
      @publisher = Publisher.find(params[:id])