railsads/app/controllers/zones_controller.rb

SELECT "publishers".* FROM "publishers" WHERE "publishers"."id" = ? LIMIT 1  [["id", "2"]]
---
  def new
  	@zone = Zone.new
  	@publisher = Publisher.find(params[:format])

SELECT "zones".* FROM "zones" WHERE "zones"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "publishers".* FROM "publishers" WHERE "publishers"."id" = ? LIMIT 1  [["id", 2]]
---
  def show
  	@zone = Zone.find(params[:id])
  	@publisher = Publisher.find(@zone.publisher_id)

SELECT "zones".* FROM "zones" WHERE "zones"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "publishers".* FROM "publishers" WHERE "publishers"."id" = ? LIMIT 1  [["id", 2]]
---
  def edit
  	@zone = Zone.find(params[:id])
  	@publisher = Publisher.find(@zone.publisher_id)

INSERT INTO "zones" ("block_domain", "created_at", "name", "publisher_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["block_domain", ""], ["created_at", Sun, 01 Sep 2013 14:03:38 UTC +00:00], ["name", "is pub id 1"], ["publisher_id", 1], ["updated_at", Sun, 01 Sep 2013 14:03:38 UTC +00:00]]
---
  def create
  	@zone = Zone.new(zone_params)

  	respond_to do |format|
  		if @zone.save